//Вариант 2
//Преобразуйте следующую задачу линейного программирования в
//каноническую форму.
//Максимизировать 2x1 - 6x3 при условиях
//1)х1 + x2 - x3 ≤ 7
//2)3x1 - x2 ≥ 8
//3)-x1 + 2х2 + 2х3 ≥ 0
//4)x1, х2, х3 ≥ 0
//
//Канонический вид:
//1)х1 + x2 - x3 ≤ 7
//2)-3x1 + x2 ≤ -8
//3)x1 - 2х2 - 2х3 ≤ 0
//F - 2x1 + 6x3 = 0
//4)x1, х2, х3 ≥ 0 это в матрицу не указываем, так как
// в каноническом виде на все переменные наложены требования неотрицательности

// в матрицу заносятся сначала, то что справа от знака,
// а потом коэфициенты переменных в уравнениях или неравенствах

public class Main {
    public static void main(String[] args) {
        double[][] matrix = {
                {7, 1, 1, -1},
                {-8, -3, 1, 0},
                {0, 1, -2, -2},
                {0, -2, 0, 6}
        };

        Table table = new Table(matrix);
        double[] result = table.calculate(matrix.length - 1);
        System.out.println("x1 " + result[0]);
        System.out.println("x2 " + result[1]);
        System.out.println("x3 " + result[2]);
    }
}